PKS1C/src/Documents/СменаДатКлючевыхНосителей/СменаДатКлючевыхНосителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СменаДатКлючевыхНосителей</name>
  <registerRecords>InformationRegister.ДатыКлючевыеНосители</registerRecords>
  <attributes>
    <name>КлючевойНоситель</name>
    <type>
      <types>CatalogRef.КлючевыеНосители</types>
    </type>
  </attributes>
  <attributes>
    <name>RSAС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RSAДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГОСТС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГОСТДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

PKS1C/src/InformationRegisters/ДатыКлючевыеНосители/ДатыКлючевыеНосители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыКлючевыеНосители</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>RSAС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>RSAДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГОСТС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГОСТДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КлючевойНоситель</name>
    <type>
      <types>CatalogRef.КлючевыеНосители</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/Documents/СменаДатКлючевыхНосителей/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция  КлючевойНосительПриИзмененииНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	ЗапросДат = Новый Запрос;
	ЗапросДат.Текст = 
		"ВЫБРАТЬ
		|	ДатыКлючевыеНосителиСрезПоследних.RSAС КАК RSAС,
		|	ДатыКлючевыеНосителиСрезПоследних.RSAДо КАК RSAДо,
		|	ДатыКлючевыеНосителиСрезПоследних.ГОСТС КАК ГОСТС,
		|	ДатыКлючевыеНосителиСрезПоследних.ГОСТДо КАК ГОСТДо,
		|	ДатыКлючевыеНосителиСрезПоследних.Регистратор.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.ДатыКлючевыеНосители.СрезПоследних(, ) КАК ДатыКлючевыеНосителиСрезПоследних
		|ГДЕ
		|	ДатыКлючевыеНосителиСрезПоследних.КлючевойНоситель = &КлючевойНоситель";
	
	ЗапросДат.УстановитьПараметр("КлючевойНоситель", Об.КлючевойНоситель);
	РезультатЗапросаДат = ЗапросДат.Выполнить();
	
	ВыборкаДат = РезультатЗапросаДат.Выбрать();
	ВыборкаДат.Следующий();
	
	Если Не ВыборкаДат.Количество() = 0 Тогда 
		Об.ГОСТДо = ВыборкаДат.ГОСТДо;
		Об.RSAДо = ВыборкаДат.RSAДо;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецФункции

&НаКлиенте
Процедура КлючевойНосительПриИзменении(Элемент)
	КлючевойНосительПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Параметры.Ключ.Пустая() Тогда 
		Объект.ГОСТС = ТекущаяДата();
		Объект.RSAС = ТекущаяДата();
	КонецЕсли;
	Если НаОсновании Тогда
		КлючевойНосительПриИзмененииНаСервере();	
	КонецЕсли;
КонецПроцедуры
